{
    "ALL_CATEGORIES_ARE_ZERO": "We can't draw this chart because all values are zero.",
    "WAITING_FOR_DATA": "waiting for data",
    "NO_DATA_RECEIVED": "The program finished and the chart received no data.",
    "DOWNSAMPLING_WARNING": "There are too many points to fit on the chart so we are downsampling by averaging. You can control this with the \"-downsample\" parameter.",
    "TIME_FIELD_ERROR": "The \"timeField\" you specified does not contain valid values.",
    "COULD_NOT_DETERMINE_VALUE_FIELD": "We could not find a field to use for the \"valueField.\" Please specify one for the chart.",
    "COULD_NOT_DETERMINE_CATEGORY_FIELD": "We could not find a field to use for the \"categoryField.\" Please specify one for the chart.",
    "VALUE_FIELD_NON_EXISTANT": "We couldn't draw the chart because the selected valueField \"{{valueField}}\" has no value.",
    "VALUE_FIELD_NON_NUMERIC": "We couldn't draw the chart because the selected valueField \"{{valueField}}\" must be numeric.",
    "VALUE_FIELD_ERROR": "We couldn't draw the chart because the selected valueField \"{{valueField}}\" has no value.",
    "BAR_COUNT_LIMIT_REACHED": "You are trying to draw more bars than the limit of {{barCountLimit}}.",
    "TABLE_ROW_LIMIT_REACHED": "Currently we are displaying only the first {{rowLimit}} rows of the table. You can control this with the \"display.limit\" parameter.",
    "LOGGER_DISPLAY_LIMIT_REACHED": "Currently we are displaying only the first {{displayLimit}} items in the output. You can control this with the \"display.limit\" parameter.",
    "MULTIPLE_POINTS_SAME_TIME_SAME_SERIES": "We found points in the same series with the same timestamp. The most likely cause is that your \"keyfield\" parameter is not identifying unique series.",
    "DATA_LIMIT_REACHED": "Currently we are displaying only the most recent {{limit}} points. You can control this with the \"display.limit\" parameter.",
    "DATA_OUTSIDE_RANGE": "Data is flowing but the points are outside of the defined range. You can control this with the \"minValue\" and \"maxValue\" parameters for \"xScales\" and \"yScales\".",
    "SCATTER_COULD_NOT_DETERMINE_CONTROL_FIELD": "We could not find a numeric field to use for the \"controlField.\" Please specify one for the chart.",
    "SCATTER_CONTROL_FIELD_NON_NUMERIC": "We couldn't draw the chart because the selected controlField \"{{controlField}}\" must be numeric.",
    "SERIES_LIMIT_REACHED": "Your data contains more series than the {{seriesLimit}} series limit. You can control this limit with the \"-seriesLimit\" parameter."
}
